import numpy as np
from lib import linear_systems as ls
np.set_printoptions(precision=4, floatmode='maxprec_equal', suppress=True)


# Testes

M = np.float64([[10, 2,  1,  7],
                [ 1, 5,  1, -8],
                [ 2, 3, 10,  6]])
X = np.float64([0, 0, 0])

ls.gauss_seidel(M, X, 10, 0.02)


M = np.float64([[10,   2,  1,  7],
                [ 1, -15,  1, 32],
                [ 2,   3, 10,  6]])
X = np.float64([0, 0, 0])

ls.relaxation(M, X, 10, 0.1)


# Lista

# Questão 1

# M = np.float64([[16.1,   2.8,  2.7,  9.9,  -26.5],
#                 [ 1.0,   8.2, -4.9, 15.4,  236.0],
#                 [ 8.7, -19.1, -3.2, -6.2, -269.3],
#                 [ 8.6,   9.0, 23.8, -6.0, -187.3]])
M = np.float64([[16.1,   2.8,  2.7,  9.9,  -26.5],
                [ 8.7, -19.1, -3.2, -6.2, -269.3],
                [ 8.6,   9.0, 23.8, -6.0, -187.3],
                [ 1.0,   8.2, -4.9, 15.4,  236.0]])
X = np.float64([-8.1, 8.2, -5.6, 9.7])

ls.gauss_seidel(M, X, 5, 0.001)

# Questão 2

M = np.float64([[-0.5, -2.3,  1.7,  8.0,  73.4],
                [ 1.8, -2.6, -5.3,  5.9, -32.1],
                [-7.7, -3.9, -7.0,  3.7,   7.3],
                [-3.7,  8.1,  6.7, -1.5, 123.8]])
X = np.float64([-8.4, 4.9, 9.7, 8])

ls.relaxation(M, X, 6, 0.01)

# Questão 3

M = np.float64([[-2.3, -5.4, -9.8, -83.7],
                [-2.7,  6.7, -5.5, -74.8],
                [ 6.8,  1.6,  0.6,  56.2]])
X = np.float64([8, -1.7, 7.6])

ls.relaxation(M, X, 6, 0.01)

# Questão 4

M = np.float64([[14.1, -2.8,  9.5, 135.1],
                [-2.6, -4.6,  0.1,  15.4],
                [ 2.1,  6.0, -9.0, -32.0]])
X = np.float64([7.9, -7.8, 0.2])

ls.gauss_seidel(M, X, 5, 0.001)
